#include <stdio.h>

/**
 * 1. 算术运算符和算术表达式
 * 2. 自增、自减运算符
 * 3. 类型转换
 */
int main(){

//    ----------------------------------算术运算符和算术表达式
    printf("%f\n", 20/7);
    printf("%d, %d\n", 20/7, -20/7);
    printf("%f, %f\n", 20.0/7, -20.0/7);
    printf("%d\n", 100%3);
    printf("---------------\n");

//    ----------------------------------自增、自减运算符
    int i=8;
    printf("%d\n",++i);     // >> 9, i=9
    printf("%d\n",--i);     // >> 8, i=8
    printf("%d\n",i++);     // >> 8, i=9
    printf("%d\n",i--);     // >> 9, i=8
    printf("%d\n",-i++);    // >> -8, i=9
    printf("%d\n",-i--);    // >> -9, i=8
    printf("---------------\n");

//    ----------------------------------类型转换
    int a, b = 322;
    float x, y = 8.88;
    char c1 = 'k', c2;
    a = y;
    x = b;
    a = c1;
    c2 = b;
    printf("%d, %f, %d, %c\n", a, x, a, c2);
    printf("---------------\n");
}