#include <stdio.h>

/**
 * 1. 浮点型的舍入误差
 * 2. 字符变量的使用
 * 3. 各类数值型数据之间的混合运算
 * 4. 强制类型转换
 */
int main(){

//    ----------------------------------浮点型的舍入误差
    float a, b;
    a = 123456.789e5;
    b = a + 20;
    printf("%f\n", a);
    printf("%f\n", b);

    printf("%f\n", 1.0/3*3);
    printf("%f\n", 3/2);
    printf("%f\n", 1/3*3);
    printf("---------------\n");

//    ----------------------------------字符变量的使用
    char x, y;
    x = 120;
    y = 121;
    char c = '\101';
    printf("%c\n", c);
    printf("%c, %c\n", x, y);
    printf("%d, %d\n", x, y);
    printf("---------------\n");

//    ----------------------------------大小写字母转换
    char m, n;
    m = 'm';
    n = 'n';
    m = m - 32;
    n = n - 32;
    printf("%c, %c\n", m, n);
    printf("%d, %d\n", m, n);
    printf("---------------\n");

//    ----------------------------------各类数值型数据之间的混合运算
    float pi = 3.14159;
    int s, r = 4;
    s = r * r * 3.14159;
    printf("s=%d\n", s);
    printf("---------------\n");

//    ----------------------------------强制类型转换
    float f = 5.75;
    printf("(int)f=%d, f=%f\n", (int)f, f);
    printf("---------------\n");

}